#include<stdio.h>

//企业发放的奖金根据利润I提成。

//利润I低于或等于100000元的，奖金可提10%;
//利润高于100000元，低于或等于200000元（100000<I≤200000）时，低于等于100000元部分按10％提成，高于100000元的部分，可提成 7.5%;
//200000<I≤400000时，低于200000元部分仍按上述办法提成（下同），高于200000元的部分按5％提成；
//400000<I≤600000元时，高于400000元的部分按3％提成；

//600000<I≤1000000时，高于600000元的部分按1.5%提成；
//I>1000000时，超过1000000元的部分按1%提成。

//从键盘输入当月利润I,求应发奖金总数。

//输入格式
//一个整数，当月利润。

//输出格式
//一个整数，奖金。

int main()
{
    int lr;
    scanf("%d",&lr);
    if(lr<=100000){
        int tc;
        tc=(lr*0.1);
        printf("%d",tc);
    }
    //低于等于100000元部分按10％提成，高于100000元的部分，可提成 7.5%;
    if(lr>100000&&lr<=200000){
         int dy100000,gy100000;
         dy100000=100000;
         gy100000=(lr-dy100000);
         //计算低于的
         int tcdy;
         tcdy=(dy100000*0.1);
         //计算高于的
         int tcgy;
         tcgy=(gy100000*0.075);
         //计算总得
         int tc;
         tc=(tcdy+tcgy);
         //打印
         printf("%d",tc);          
    }
    ///200000<I≤400000时，低于200000元部分仍按上述办法提成（下同），高于200000元的部分按5％提成；
    if(lr>200000&&lr<=400000){
         int dy200000,gy200000;
         dy200000=200000;
         gy200000=(lr-dy200000);
         //计算低于的
         int tcdy;
         tcdy=(dy200000*0.1);
         //计算高于的
         int tcgy;
         tcgy=(gy200000*0.05);
         //计算总得
         int tc;
         tc=(tcdy+tcgy);
         //打印
         printf("%d",tc);          
    }
    //400000<I≤600000元时，高于400000元的部分按3％提成；
    if(lr>400000&&lr<=600000){
         int dy400000,gy400000;
         dy400000=400000;
         gy400000=(lr-dy400000);
         //计算低于的
         int tcdy;
         tcdy=(dy400000*0.1);
         //计算高于的
         int tcgy;
         tcgy=(gy400000*0.03);
         //计算总得
         int tc;
         tc=(tcdy+tcgy);
         //打印
         printf("%d",tc);          
    }
    
    if(lr>600000&&lr<=1000000){
         int dy600000,gy600000;
         dy600000=600000;
         gy600000=(lr-dy600000);
         //计算低于的
         int tcdy;
         tcdy=(dy600000*0.1);
         //计算高于的
         int tcgy;
         tcgy=(gy600000*0.015);
         //计算总得
         int tc;
         tc=(tcdy+tcgy);
         //打印
         printf("%d",tc);          
    }
    
    if(lr>1000000){
         int dy1000000,gy1000000;
         dy1000000=1000000;
         gy1000000=(lr-dy1000000);
         //计算低于的
         int tcdy;
         tcdy=(dy1000000*0.1);
         //计算高于的
         int tcgy;
         tcgy=(gy1000000*0.01);
         //计算总得
         int tc;
         tc=(tcdy+tcgy);
         //打印
         printf("%d",tc);          
    }
    
}
